.doom.d/Emacs.org
* Celestial-mode-line
#+begin_src emacs-lisp
;; (use-package! celestial-mode-line
;;   :config
;;   (setq calendar-longitude "20.54S")
;;   (setq calendar-latitude "47.40W")
;;   (setq calendar-location-name "Franca, SP")
;;   (defvar celestial-mode-line-phase-representation-alist '((0 . "○") (1 . "☽") (2 . "●") (3 . "☾")))
;;   (defvar celestial-mode-line-sunrise-sunset-alist '((sunrise . "☀↑ ") (sunset . "☀↓ ")))
;;   (defvar celestial-mode-line-phase-representation-alist '((0 . "( )") (1 . "|)") (2 . "(o)") (3 . "|)")))
;;   (defvar celestial-mode-line-sunrise-sunset-alist '((sunrise . "*^") (sunset . "*v")))
;;   (celestial-mode-line-start-timer))
#+end_src

#+begin_src emacs-lisp
(defun lw/sunset ()
  (interactive)
  (display-message-or-buffer (message "`%s'" (solar-sunrise-sunset-string (calendar-current-date)))))

(map! :leader
      (:prefix-map ("b" . "buddhi")
       :desc "Sunrise sunset info" "µ" #'lw/sunset))
#+end_src

#+RESULTS:
: lw/sunset

* Roam
#+begin_src emacs-lisp
(use-package! deft
  :bind ("<f2>" . deft)
  :commands (deft)
  :config (setq deft-directory "~/buddhi-roam/"
                deft-extensions '("md" "org"))
  :after org
  :bind
  ("C-c n d" . deft)
  :custom
  (deft-recursive t)
  (deft-use-filter-string-for-filename t)
  (deft-default-extension "org"))
  ;; (deft-directory org-roam-directory))

#+end_src
* PDFs in Emacs
#+begin_src emacs-lisp
(use-package! pdf-tools)
#+end_src
* Programming Languages
** LaTeX
#+begin_src emacs-lisp :tangle no
(setq org-format-latex-options (plist-put org-format-latex-options :scale 3.0))
#+end_src

#+RESULTS:
| :foreground | default | :background | default | :scale | 3.0 | :html-foreground | Black | :html-background | Transparent | :html-scale | 1.0 | :matchers | (begin $1 $ $$ \( \[) |
** Julia

* ERC/IRC Twitch

#+begin_src emacs-lisp
;; (use-package! erc-hl-nicks)
;; (use-package! erc-colorize)

;; (use-package! erc-twitch
;;   :config
;;   (add-hook! erc-twitch-mode-hook #'erc-colorize-enable)
;;   (add-hook! erc-twitch-mode-hook #'erc-hl-nicks-enable))
#+end_src

#+RESULTS:
: erc-colorize
* Pass
#+begin_src emacs-lisp
;; (use-package! hidepw)
#+end_src

#+RESULTS:
: hidepw

#+begin_src emacs-lisp
;; (use-package! helm-pass)
#+end_src

#+RESULTS:
: helm-pass

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       :desc "Password list" "p" #'helm-pass))
#+end_src

#+RESULTS:
: helm-pass
* Navigation
#+begin_src emacs-lisp
(load! "./my-func/goto.el")
#+end_src

#+begin_src emacs-lisp
(load! "./my-func/diary.el")
#+end_src

** Diary

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       :desc "Diary entry" "d" #'lw/create-or-access-diary))
#+end_src
** Evil Deeds

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("n" . "navigate to")
        :desc "Evil Deeds" "n" #'lw/find-evildeeds)))
#+end_src

#+RESULTS:
: lw/find-evildeeds

** Function definitions
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("n" . "navigate to")
        :desc "Function at point" "f" #'find-function-at-point)))
#+end_src

#+RESULTS:
: find-function-at-point
** Go to =Emacs.org= and =my-func.org=


#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("n" . "navigate to")
        :desc "Emacs.org" "e"  #'lw/goto-emacs-org
        :desc "my-func.org" "F" #'lw/goto-my-func-org)))
#+end_src

#+RESULTS:
: lw/goto-my-func-org
** Navigate to books

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("n" . "navigate to")
        :desc "Active CS book" "a"  #'lw/goto-cs-active
        :desc "CS books" "c" #'lw/goto-cs-books)))
#+end_src

#+RESULTS:
: lw/goto-cs-books
** Navigate to book notes
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("n" . "navigate to")
        :desc "Book notes" "n"  #'lw/goto-book-notes)))
#+end_src

* Magit
#+begin_src emacs-lisp
(map! :leader
      :desc "Magit" "m" #'magit)
#+end_src

* Proof General and Coq
#+begin_src emacs-lisp
;; (use-package! company-coq)
;; (use-package! coq-commenter)
;; (use-package! proof-general
;;   :config
;;   (add-hook! 'coq-mode-hook #'company-coq-mode)
;;   (add-hook! 'coq-mode-hook #'coq-commenter-mode))
#+end_src

#+RESULTS:
: t

* Anaconda
#+begin_src emacs-lisp
(load! "./my-func/ein-babel.el")
#+end_src

#+RESULTS:
: t

* Elm
#+begin_src emacs-lisp
(use-package! elm-mode
  :hook (elm-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS:
| rainbow-delimiters-mode | elm-indent-mode |

#+begin_src emacs-lisp
;; (use-package! elm-oracle
;;   :config
;; (with-eval-after-load 'company
;;         (add-to-list 'company-backends 'company-elm))
;; (add-hook 'elm-mode-hook #'elm-oracle-setup-completion)
#+end_src

#+begin_src shell
npm install -g elm-oracle
#+end_src

* Comment Julia

# #+begin_src emacs-lisp
# (setq inferior-julia-program-name "julia")
# #+end_src

# #+RESULTS:
# : julia

# #+begin_src emacs-lisp
# (package! julia-vterm
   #   :recipe (:host github
                #            :repo "shg/julia-vterm.el"))

# (package-install-file "~/.doom.d/julia-vterm.el/julia-vterm.el")

# (package! ob-julia-vterm
   #   :recipe (:host github
                #            :repo "shg/ob-julia-vterm.el"))

# (package-install-file "~/.doom.d/ob-julia-vterm.el/ob-julia-vterm.el")

# (package! ob-julia
   #   :recipe (:host github
                #            :repo "gjkernsx/ob-julia"))

# ;; (package-install-file "~/.doom.d/ob-julia/ob-julia.el")

# (add-hook 'julia-mode-hook #'julia-vterm-mode)
# (setq julia-vterm-repl-program "/usr/bin/julia -t 4")

# (require 'org)
# (add-to-list 'org-babel-load-languages '(julia-vterm . t))
# (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
# (defalias 'org-babel-execute:julia 'org-babel-execute:julia-vterm)
# #+end_src

# #+begin_src emacs-lisp
# (add-to-list 'load-path "~/.doom.d/ob-julia/ob-julia.el")
# #+end_src

# To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

# #+begin_src emacs-lisp
# ;; (with-eval-after-load 'org
# ;;   (org-babel-do-load-languages
# ;;    'org-babel-load-languages
# ;;    '((emacs-lisp . t)
# ;;      (python . t)
# ;;      (browser . t)
# ;;      (ditaa . t)
# ;;      (R . t)
# ;;      (go . t)
# ;;      ;; (ipython . t)
# ;;      (julia-vterm . t)
# ;;      ;; (julia . t)
# ;;      (ein . t)
# ;;      (ditaa . t)
# ;;      (css . t)
# ;;      (lisp . t)
# ;;      (latex . t)
# ;;      (clojure . t)
# ;;      (clojurescript . t)))
# ;;   (push '("conf-unix" . conf-unix) org-src-lang-modes))
# #+end_src

# #+begin_src emacs-lisp
# (custom-set-variables
   #  '(ob-ein-languages
        #    '(("ein-python" . python)
               #      ("ein-R" . R)
               #      ("ein-r" . R)
               #      ("ein-julia" . julia))))
# #+end_src

# #+RESULTS:

# #+begin_src emacs-lisp
# (use-package julia-mode)
# #+end_src

# #+RESULTS:

# #+begin_src emacs-lisp
# (use-package julia-snail)
# #+end_src

# #+RESULTS:

# #+begin_src emacs-lisp
#    (setq inferior-julia-program-name "julia")
# #+end_src
* Web browser
#+begin_src emacs-lisp
;; (use-package! eaf
;;   :load-path "~/.doom.d/site-lisp/emacs-application-framework"
;;   :custom
;;   ; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
;;   (eaf-browser-continue-where-left-off t)
;;   (eaf-browser-enable-adblocker t)
;;   (browse-url-browser-function 'eaf-open-browser)
;;   :config
;;   (defalias 'browse-web #'eaf-open-browser))
;;   ;; (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
;;   ;; (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
;;   ;; (eaf-bind-key take_photo "p" eaf-camera-keybinding)
;;   ;; (eaf-bind-key nil "M-q" eaf-browser-keybinding)) ;; unbind, see more in the Wiki
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.doom.d/site-lisp/emacs-application-framework/")
#+end_src

#+RESULTS:
| ~/.doom.d/site-lisp/emacs-application-framework/ | ~/.doom.d/sit |

# #+begin_src emacs-lisp
# # (require 'eaf)
# # (require 'eaf-browser)
# # #+end_src

#+RESULTS:
: eaf-browser
* Python
** Anaconda

#+begin_src emacs-lisp :tangle packages.el
(package! conda)
#+end_src

#+begin_src emacs-lisp
;; (use-package! conda
;;   :config
;;   ;; (setq
;;   ;;  conda-env-home-directory (expand-file-name "~/opt/miniconda3/")
;;   ;;  conda-env-subdirectory "envs/")
;;   (custom-set-variables '(conda-anaconda-home "/opt/miniconda3/"))
;;   (conda-env-initialize-interactive-shells)
;;   (conda-env-initialize-eshell)
;;   (conda-env-autoactivate-mode t))
#+end_src
** Ipython
#+begin_src emacs-lisp :tangle packages.el
(package! ein)
#+end_src

#+begin_src emacs-lisp
;; (use-package! ein)
;; (require 'ein)
#+end_src

* Haskell
#+begin_src emacs-lisp :tangle no
(use-package! haskell-mode
  :config
  (define-key! map [?\C-c ?r] 'haskell-run))
#+end_src

#+RESULTS:
: t

* Go
#+begin_src emacs-lisp
;; (use-package! go-complete
;;   :config
;;  (add-hook 'completion-at-point-functions 'go-complete-at-point))
#+end_src

#+begin_src emacs-lisp :eval yes
(setq gofmt-command "goimports")
(add-hook 'before-save-hook 'gofmt-before-save)
#+end_src

#+RESULTS:
| gofmt-before-save | undo-fu-session-save-safe |

* Xthemes
#+begin_src emacs-lisp :tangle packages.el
(package! ewal-doom-themes)
(package! doom-themes)
(package! doom-modeline-now-playing)
(package! doom-modeline)
#+end_src
#+RESULTS:
: doom-modeline

#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-acario-dark t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  ;; (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  ;; (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src
* W3M
#+begin_src emacs-lisp
;; (use-package! w3m
;;   :config
;;   (setq w3m-search-default-engine "duckduckgo"))
#+end_src
