.doom.d/config.el
        :desc "w3m search" "s" #'w3m-search
        :desc "dictionary search" "d" #'dictionary-search)))

      ;; (use-package latex-extra)

   ;; ; SyncTeX basics

   ;; ; un-urlify and urlify-escape-only should be improved to handle all special characters, not only spaces.
   ;; ; The fix for spaces is based on the first comment on http://emacswiki.org/emacs/AUCTeX#toc20

   ;; (defun un-urlify (fname-or-url)
   ;;   "Transform file:///absolute/path from Gnome into /absolute/path with very limited support for special characters"
   ;;   (if (string= (substring fname-or-url 0 8) "file:///")
   ;;       (url-unhex-string (substring fname-or-url 7))
   ;;     fname-or-url))

   ;; (defun urlify-escape-only (path)
   ;;   "Handle special characters for urlify"
   ;;   (replace-regexp-in-string " " "%20" path))

   ;; (defun urlify (absolute-path)
   ;;   "Transform /absolute/path to file:///absolute/path for Gnome with very limited support for special characters"
   ;;   (if (string= (substring absolute-path 0 1) "/")
   ;;       (concat "file://" (urlify-escape-only absolute-path))
   ;;       absolute-path))


   ;; ; SyncTeX backward search - based on http://emacswiki.org/emacs/AUCTeX#toc20, reproduced on https://tex.stackexchange.com/a/49840/21017

   ;; (defun th-evince-sync (file linecol &rest ignored)
   ;;   (let* ((fname (un-urlify file))
   ;;          (buf (find-file fname))
   ;;          (line (car linecol))
   ;;          (col (cadr linecol)))
   ;;     (if (null buf)
   ;;         (message "[Synctex]: Could not open %s" fname)
   ;;       (switch-to-buffer buf)
   ;;       (goto-line (car linecol))
   ;;       (unless (= col -1)
   ;;         (move-to-column col)))))

   ;; (defvar *dbus-evince-signal* nil)

   ;; (defun enable-evince-sync ()
   ;;   (require 'dbus)
   ;;   ; cl is required for setf, taken from: http://lists.gnu.org/archive/html/emacs-orgmode/2009-11/msg01049.html
   ;;   (require 'cl)
   ;;   (when (and
   ;;          (eq window-system 'x)
   ;;          (fboundp 'dbus-register-signal))
   ;;     (unless *dbus-evince-signal*
   ;;       (setf *dbus-evince-signal*
   ;;             (dbus-register-signal
   ;;              ;; :session nil "/org/gnome/evince/Window/0"
   ;;              "org.gnome.evince.Window" "SyncSource"
   ;;              'th-evince-sync)))))

   ;; (add-hook 'LaTeX-mode-hook 'enable-evince-sync)


   ;; ; SyncTeX forward search - based on https://tex.stackexchange.com/a/46157

   ;; ;; universal time, need by evince
   ;; (defun utime ()
   ;;   (let ((high (nth 0 (current-time)))
   ;;         (low (nth 1 (current-time))))
   ;;    (+ (* high (lsh 1 16) ) low)))

   ;; ;; Forward search.
   ;; ;; Adapted from http://dud.inf.tu-dresden.de/~ben/evince_synctex.tar.gz
   ;; ;; (defun auctex-evince-forward-sync (pdffile texfile line)
   ;; ;;   (let ((dbus-name
   ;; ;;      (dbus-call-method :session
   ;; ;;                "org.gnome.evince.Daemon"  ; service
   ;; ;;                "/org/gnome/evince/Daemon" ; path
   ;; ;;                "org.gnome.evince.Daemon"  ; interface
   ;; ;;                "FindDocument"
   ;; ;;                (urlify pdffile)
   ;; ;;                t     ; Open a new window if the file is not opened.
   ;; ;;                )))
   ;; ;;     (dbus-call-method :session
   ;; ;;           dbus-name
   ;; ;;           "/org/gnome/evince/Window/0"
   ;; ;;           "org.gnome.evince.Window"
   ;; ;;           "SyncView"
   ;; ;;           (urlify-escape-only texfile)
   ;; ;;           (list :struct :int32 line :int32 1)
   ;; ;;   (utime))))

   ;; ;; (defun auctex-evince-view ()
   ;; ;;   (let ((pdf (file-truename (concat default-directory
   ;; ;;                     (TeX-master-file (TeX-output-extension)))))
   ;; ;;     (tex (buffer-file-name))
   ;; ;;     (line (line-number-at-pos)))
   ;; ;;     (auctex-evince-forward-sync pdf tex line)))

   ;; ;; New view entry: Evince via D-bus.
   ;; (setq TeX-view-program-list '())
   ;; (add-to-list 'TeX-view-program-list
   ;;          '("evince" auctex-evince-view))

   ;; ;; Prepend Evince via D-bus to program selection list
   ;; ;; overriding other settings for PDF viewing.
   ;; (setq TeX-view-program-selection '())
   ;; (add-to-list 'TeX-view-program-selection
   ;;          '(output-pdf "evince"))

   ;; (use-package! latex-preview-pane)
   ;; (use-package! latex-pretty-symbols)

;; (use-package! auto-complete-auctex)

;; (use-package! sqlformat
;;   :config
;;   (setq sqlformat-command 'pgformatter)
;;   (add-hook 'sql-mode-hook 'sqlformat-on-save-mode))

(map! :leader
      (:prefix-map ("b" . "buddhi")
        :desc "centered-cursor-mode" "C-l" #'centered-cursor-mode)
      (:desc "anzu-replace" "r" #'anzu-replace-at-cursor-thing))

(load! "./my-func/define-modules.el")

(load! "./my-func/load-modules.el")

(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("l" . "load module")
        :desc "Chinese" "c" #'lw/load-chinese
        :desc "LaTeX" "l" #'lw/load-latex)))

(load! "./my-func/isosec.el")

(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("z" . "Zettle funcs")
          :desc "Isosec" "i" #'blw/insert-current-isosec)))

(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix-map ("r" . "read")
        :desc "EPUB refresh size" "r" #'nov-render-document)))

(load! "./my-func/fast-input-method.el")
(evil-mode)

;; (use-package impatient-mode)

(add-hook 'typescript-mode-hook 'eslint-rc-mode)
(add-hook 'js2-mode-hook 'eslint-rc-mode)
(add-hook 'web-mode-hook 'eslint-rc-mode)

;; (setup facti-js-mode
;;    (:option js-indent-level 2)
;;    (:hook js-mode-hook))
